# ========================== 1 ===============================
# 将元组(1,2,3)和集合{4,5,6}合并成一个列表
# t = (1,2,3)
# d = {4,5,6}
# l = []
# for i1 in t:
#     l.append(i1)
# for i2 in d:
#     l.append(i2)
# print(l)
# ========================== 2 ===============================
# 在列表[1,2,3,4,5,6]首位分别添加整型元素7和0
# l = [1,2,3,4,5,6]
# l.insert(0,7)
# l.append(0)
# print(l)
# ========================== 3 ===============================
# 反转列表[0,1,2,3,4,5,6,7]
# l = [0,1,2,3,4,5,6,7]
# l.reverse()
# print(l)
# ========================== 4 ===============================
#反转列表[0,1,2,3,4,5,6,7]后给出中元素5的索引号
# l = [0,1,2,3,4,5,6,7]
# l.reverse()
# print(l.index(5))
# ========================== 5 ===============================
# 分别统计[True,False,0,1,2]中True,False,0,1,2元素的个数,发现了什么
data = [True,False,0,1,2]
countT = 0
countF = 0
count0 = 0
count1 = 0
count2 = 0
for i in data:
    if i == True:
        countT+=1
    elif i == False:
        countF+=1
    elif i == 0:
        count0+=1
    elif i == 1:
        count1+=1
    elif i ==2:
        count2+=1
print(countT,countF,count0,count1,count2)

